{
  "intro": "Welcome to my website and thank you for visiting! I'm Caleb Richardson, a dedicated Python developer and avid self-learner with a passion for traveling. My coding journey began in high school and has continued to grow ever since. I specialize in Python and am excited to grow in my programming career.\n\nOn this site, you'll find a showcase of my project portfolio, complete with links to deployed projects and initial production environments. I am always ready and eager to connect with others, expand my portfolio, and enhance my skills. Please feel free to reach out to me on any listed social media platforms.",
  "education": [
    {
      "degree": "Associate's of Computer Technology",
      "date": "Graduated May 2020",
      "location": "SUNY Broome - Binghamton, NY",
      "notable": "GPA 3.4"
    }
  ],
  "self_learning": [
    {
      "name": "Udemy Courses",
      "courses": [
        "Python",
        "C/C++",
        "SQL",
        "Sorting Algorithms"
      ]
    }
  ],
  "work_history": [
    {
      "title": "Software Technician I",
      "dates": "September 2022 - July 2024",
      "company": "Corning Inc",
      "tasks": [
        "Developed and completed a control loop monitoring dashboard system, taking it from a proof of concept to full deployment across multiple lines in a manufacturing plant",
        "Self-taught, after original developer left, to become a trusted resource in VisualKPI and integration with AVEVA PI System and Microsoft SQL data",
        "Was a lead developer for integration work on a small team of four that used Agile Development methodology",
        "    Tech: AVEVA PI System, VisualKPI, Microsoft SQL scripting, and database management"
      ]
    },
    {
      "title": "Test Engineer",
      "dates": "July 2021 - August 2022",
      "company": "Southern Tier Technology",
      "tasks": [
        "Tested all power monitoring units for full functionality prior to shipment, ensuring quality control and compliance with standards",
        "Created documentation for unit testing procedures and training materials for new team members",
        "Created and modified functions on PIC18F processor for power analysis detection like surges, swells, and sags",
        "Tech: PICkit3, Oscilloscope, Multimeter, C/ C++"
      ]
    },
    {
      "title": "Contract Engineer",
      "dates": "September 2020 - June 2021",
      "company": "Corning Inc",
      "tasks": [
        "Proactively developed an application (VBA) that collected data on manufacturing equipment and referenced maintenance & prioritization matrix to give an overall status",
        "Assisted creating maintenance & prioritization matrix using maintenance records and direct observation",
        "Presented data collected, over 100 pieces of equipment, to plant stakeholders"
      ]
    },
    {
      "title": "Intern",
      "dates": "July 2018 - September 2018",
      "company": "Lockheed Martin",
      "tasks": [
        "Create projects to show the Design Process",
        "Created internal tool to show all available tools in workshop areas"
      ]
    }
  ],
  "me_images": [
    "IMG/BahamasDrink.jpg",
    "IMG/hiking_portrit.jpg",
    "IMG/MagicCon.jpg",
    "IMG/Skydiving.jpg",
    "IMG/Snowboarding_selfie.jpg"
  ],
  "projects": [
    {
      "name": "Portfolio/ Resume Website",
      "description": "This project is what you are seeing! It's this whole website dedicated to telling you about me and giving a place to show off my projects.",
      "skills": [
        "Python",
        "HTMl"
      ],
      "github": "https://github.com/KingBubIII/portfolio_website",
      "link": "/about-me",
      "preview": null
    },
    {
      "name": "Automated Personal Finance",
      "description": "This project is for tracking my monthly expenses. It uses online bank's exported CSV files in combination with user defined rules to automatically put purchases into categories. This way you don't have to go through each transaction every month to categorize by hand.\n There is not a lot of customization for online budget trackers since they have predefined categorizes and their own way of automatically categoizing.",
      "skills": [
        "Python"
      ],
      "github": "https://github.com/KingBubIII/personal-finance-automated",
      "link": "https://calebrichardson.dev/demos/personal_finance_automated/",
      "preview": "IMG/personal_finance_automated_preview.png"
    },
    {
      "name": "Steam Library Comparer",
      "description": "This project is for people who use Steam and Discord and is for finding common games between two users. Ideally two people on Discord find eachother through a common server and want to play together and use my discord bot to find a common game between both of their Steam libraries.",
      "skills": [
        "Webscraping",
        "Python",
        "API",
        "SQL"
      ],
      "github": "https://github.com/KingBubIII/discordbotgamelib",
      "link": null,
      "preview": null
    },
    {
      "name": "Single Player Racko",
      "description": "This project is meant to give me experiance with stacks and queues data structures beyond just example functions. This is a simple game that uses stacks and queue opperations to organize numbers.",
      "skills": [
        "Python",
        "Data-Structures"
      ],
      "github": "https://github.com/KingBubIII/sp_racko",
      "link": null,
      "preview": null
    },
    {
      "name": "Favorites API",
      "description": "I wrote a basic RESTful API that shows some of my favorite media like movies or TV shows. You can use my documentation in order to query specifics and or filter.",
      "skills": [
        "Python",
        "API",
        "Documentation"
      ],
      "github": "https://github.com/KingBubIII/favorites_API",
      "link": "https://docs.calebrichardson.dev/favorites_API/",
      "preview": null
    }
  ]
}